In [2]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

### Lets creat a simple dataframe in Pandas

- If we pass a Python dictionary as the `data` to the Pandas DataFrame input argument, we can creat a Pandas DataFrame

In [4]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

### Select the second to fourth rows based on columns (name and age for example)

In [5]:
df.loc[2:4, 'name']

2    peter
3     jeff
4     bill
Name: name, dtype: object

In [4]:
df.loc[:, ['name', 'age']]

    name  age
0   john   23
1   mary   78
2  peter   22
3   jeff   19
4   bill   45
5   lisa   33

### Select the first two rows

In [6]:
# select the first 2 rows
df.iloc[:2]

   name  age state  num_children  num_pets
0  john   23  iowa             2         0
1  mary   78    dc             2         4

### Select the last two rows

In [7]:
# select the last 2 rows
df.iloc[-2:]

   name  age       state  num_children  num_pets
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

### Select rows up to and including the assigned one

In [8]:
# select rows up to and including the one
# with index=2 (this retrieves 3 rows)
df.loc[:2]

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0

### Select the first column without specifying the name of column

In [8]:
# first column of data frame
df.iloc[:,0]

0     john
1     mary
2    peter
3     jeff
4     bill
5     lisa
Name: name, dtype: object

In [21]:
df.loc[:,['age', 'state']]
# df[['age', 'state']]

   age       state
0   23        iowa
1   78          dc
2   22  california
3   19       texas
4   45  washington
5   33          dc

### Select the second row of dataframe

In [15]:
# second row of dataframe
df.iloc[1]

name            mary
age               78
state             dc
num_children       2
num_pets           4
Name: 1, dtype: object

### Filter or conditional selection of dataframe

In [4]:
# people whose "age" is greater than 30
df[df['age'] > 30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

### Another way of the above selection

In [10]:
df[df.age> 30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

### Select dataframe such that the return dataframe has more pets than children

In [11]:
# people who have more pets than children
df[ df["num_pets"] > df[ "num_children"] ]

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

### Who in the dataframe is older than 40 and own pets

In [12]:
# people older than 40 who own pets
df[ (df["age"] > 40) & (df["num_pets"] > 0) ]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

### Drop age and num_children columns

In [18]:
# df itself is not modified; a copy is returned instead
df.drop(["age","num_children"],axis=1)

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

### After droping, the original dataframe is untouched

In [14]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

### What is the average for age, num_pets and num_children

In [23]:
# Apply an aggregate function to every column
import numpy as np
df[["age","num_pets","num_children"]].apply(lambda col: np.mean(col),axis=0)

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64

In [26]:
df[["age","num_pets","num_children"]].apply(lambda col: np.sum(col),axis=0)

age             220
num_pets          9
num_children      8
dtype: int64

In [3]:
df['age'].sum()

220

In [7]:
df.sum()

name                    johnmarypeterjeffbilllisa
age                                           220
state           iowadccaliforniatexaswashingtondc
num_children                                    8
num_pets                                        9
dtype: object

### Add numerical values of age, num_pets, num_children

In [27]:
df[["age","num_pets","num_children"]].apply(lambda row: np.sum(row),axis=1)

0    25
1    84
2    22
3    25
4    47
5    34
dtype: int64

### Select dataframe based on column name

In [32]:
df[['age']]

   age
0   23
1   78
2   22
3   19
4   45
5   33

In [33]:
df['age']

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

In [6]:
df[["age"]].apply(lambda value: value*2)

   age
0   46
1  156
2   44
3   38
4   90
5   66

### Apply a function to specific column and apply the changes to original dataframe

In [35]:
df['age'] = df['age'].apply(lambda x: x*2)

In [36]:
df

    name  age       state  num_children  num_pets
0   john   46        iowa             2         0
1   mary  156          dc             2         4
2  peter   44  california             0         0
3   jeff   38       texas             1         5
4   bill   90  washington             2         0
5   lisa   66          dc             1         0

### Sort dataframe based on a specific column in ascending order

In [40]:
# Sort DataFrame by column value
df.sort_values( "age", ascending= True)

    name  age       state  num_children  num_pets
3   jeff   38       texas             1         5
2  peter   44  california             0         0
0   john   46        iowa             2         0
5   lisa   66          dc             1         0
4   bill   90  washington             2         0
1   mary  156          dc             2         4

In [39]:
df

    name  age       state  num_children  num_pets
0   john   46        iowa             2         0
1   mary  156          dc             2         4
2  peter   44  california             0         0
3   jeff   38       texas             1         5
4   bill   90  washington             2         0
5   lisa   66          dc             1         0

### Select rows whose name begins with the letter 'j'

In [41]:
# select rows whose name begins with the letter 'j'
df[df.apply(lambda row: row['name'].startswith('j'),axis=1)]

   name  age  state  num_children  num_pets
0  john   46   iowa             2         0
3  jeff   38  texas             1         5

In [42]:
from collections import OrderedDict
from pandas import DataFrame
import pandas as pd
import numpy as np

table = OrderedDict((
    ("Item", ['Item0', 'Item0', 'Item1', 'Item1']),
    ('CType',['Gold', 'Bronze', 'Gold', 'Silver']),
    ('USD',  ['1$', '2$', '3$', '4$']),
    ('EU',   ['1€', '2€', '3€', '4€'])
))
d = DataFrame(table)

In [43]:
d

    Item   CType USD  EU
0  Item0    Gold  1$  1€
1  Item0  Bronze  2$  2€
2  Item1    Gold  3$  3€
3  Item1  Silver  4$  4€

### Pivot table from dataframe

In [44]:
p = d.pivot(index='Item', columns='CType', values='USD')

In [45]:
p

CType Bronze Gold Silver
Item
Item0     2$   1$    NaN
Item1    NaN   3$     4$